test/artillery/hero/hero.insertOne.yml
config:
  target: "http://localhost:3000/api"
  phases:
    - duration: 60
      arrivalRate: 1
  processor: "./data.js"

scenarios:
  - name: "insertOne new Hero document"
    flow:
      # call generateRandomData() to create the name, email, and password variables
      - function: "generateRandomData"
      - post:
          url: "/hero"
          json:
            name: "{{ name }}"
            id: "{{ id }}"
            saying: "{{ saying }}"
      # Print the data we're sending while debugging the script:
      - log: "Sent a request to /api/hero with {{ name }}, {{ id }}, {{ saying }}"